import { FamilyMember, NewsItem, FamilyPhoto, FamilyInfo, FamilyMessage } from '../types';

export const INITIAL_MEMBERS: FamilyMember[] = [];
export const INITIAL_NEWS: NewsItem[] = [];
export const INITIAL_PHOTOS: FamilyPhoto[] = [];

export const INITIAL_INFO: FamilyInfo = {
  familyName: "آل الوفائي والعطائي",
  bio: "عائلة آل الوفائي والعطائي هي عائلة عريقة تمتد جذورها التاريخية في حمص بسوريا، وتشتهر عبر الأجيال بالتمسك بالقيم السامية، وحب العلم، والعمل الدؤوب في خدمة المجتمع، وتوطيد أواصر صلة الرحم والتكامل بين أفرادها أينما كانوا.",
  history: `آل الوفائي والعطائي أسرة تركية الأصل، قدمت مع السلطان سليم الأول العثماني حينما جاء إلى حمص فاتحاً، وسكنت حي باب التركمان في حمص مع بعض العائلات الأخرى كالأتاسي والصوفي والحسيني والحسامي.

يقال أن جدنا عمر آغا البقراصي هو ابن رمضان باشا بن محمد باشا بن أحمد باشا التركماني الجد الأعلى صاحب الأوقاف اسكدار رؤوس همايون المتوفي عام 1625 ميلادية في حمص والمبعوث كقاضي في مهمة لحل اشكالية سياسية في الولايات الوسطى لبلاد الشام.

وأن جامع النخلة العمري بناه الخليفة عمر بن الخطاب رضي الله عنه إثر مروره بحمص إبان جولته على بلاد الشام في أواخر فترة خلافته الراشدة, وفي هذا الجامع أنشئت أول دار شرعية لطلبة العلم في حمص بمبادرة من العائلة صاحبة أكبر وقف إسلامي فيها.. وسمي بالنخلة نسبة إلى نخلة كانت في صحنه..

والشائع أكثر هو نسبة إلى عمر بن يوسف الحنفي البقراصي الذي جدد بناء الجامع.. ودفن فيه عندما مات عام 1739م وقد سمي أيضاً جامع التركمان لسكن عدد كبير من التركمان حوله.

ذُكر جدنا عمر البقراصي في كتاب: "سلك الدرر في أعيان القرن الثاني عشر" لـ محمد خليل المرادي، كتب فيه: عمر بن يوسف الحنفي البقراصي نزيل حمص الشيخ الامام العالم الفاضل الكامل كان محققاً في العلوم العقيلة والنقلية جاء من بقراص بلدة في الروم وقطن في مدينة حمص وعمّر الجامع المشهور بجامع النخلة بعدما خرب ودثر)`
};

export const INITIAL_MESSAGES: FamilyMessage[] = [];
